[
    {
      "title": "تطوير أنظمة الويب",
      "price": "حسب نطاق المشروع",
      "icon": "images/logo.jpg",
      "color": "green",
      "details": [
        "تصميم أنظمة إدارة وتحكم متكاملة تناسب الشركات والمؤسسات.",
        "بناء واجهات تفاعلية عصرية لعرض وتحليل البيانات.",
        "تأمين البيانات وربطها بخدمات سحابية أو محلية.",
        "إمكانية تخصيص النظام بما يتناسب مع طبيعة العمل."
      ],
      "description": "نصمم أنظمة ويب متكاملة لإدارة ومراقبة العمليات باحترافية عالية وتجربة استخدام مريحة."
    },
    {
      "title": "تطوير تطبيقات الموبايل",
      "price": "ابتداءً من 399git ر.س",
      "icon": "assets/images/mobile-app.svg",
      "color": "orange",
      "details": [
        "تطوير تطبيقات Android وiOS متصلة بالأنظمة السحابية.",
        "تصميم واجهات سهلة وجذابة لتجربة استخدام مميزة.",
        "دمج التطبيقات مع الأجهزة الذكية أو أنظمة الإدارة.",
        "إتاحة إشعارات وتنبيهات فورية للمستخدمين."
      ],
      "description": "نقوم بتطوير تطبيقات موبايل احترافية تساعد المؤسسات والأفراد على التحكم ببياناتهم وخدماتهم بسهولة."
    },
    {
      "title": "لوحات التحكم ولوحات البيانات (Dashboards)",
      "price": "حسب تعقيد النظام",
      "icon": "assets/images/dashboard.svg",
      "color": "purple",
      "details": [
        "إنشاء لوحات عرض لحظية للبيانات التشغيلية أو الإحصائية.",
        "تصميم مخططات ورسوم بيانية تفاعلية.",
        "ربط اللوحات بمصادر البيانات أو أجهزة IoT مباشرة.",
        "واجهة استخدام مرنة تدعم جميع الأجهزة."
      ],
      "description": "نصمم لوحات تحكم ذكية تسهّل مراقبة الأنظمة واتخاذ القرارات بناءً على بيانات دقيقة وحديثة."
    },
    {
      "title": "تكامل الأنظمة البرمجية والمادية",
      "price": "يُحدد بعد دراسة المشروع",
      "icon": "assets/images/integration.svg",
      "color": "red",
      "details": [
        "دمج الأنظمة البرمجية مع المتحكمات والمستشعرات.",
        "ربط تطبيقات الويب والموبايل مع الأجهزة الذكية.",
        "تطوير حلول تتيح التفاعل بين البرمجيات والمكونات المادية.",
        "إجراء اختبارات شاملة لضمان الأداء والاستقرار."
      ],
      "description": "نوفّر حلول تكامل متقدمة بين البرمجيات والأجهزة لخلق أنظمة ذكية تعمل بتناغم وكفاءة."
    },
    {
      "title": "تصميم المواقع والمتاجر الإلكترونية",
      "price": "ابتداءً من 299 ر.س",
      "icon": "assets/images/website.svg",
      "color": "purple",
      "details": [
        "تصميم مواقع تعريفية ومتاجر إلكترونية متجاوبة مع جميع الشاشات.",
        "تحسين الأداء وتجربة المستخدم (UX/UI).",
        "تهيئة المواقع لمحركات البحث (SEO).",
        "توفير دعم فني وتحديثات مستمرة."
      ],
      "description": "نقدّم حلول تصميم مواقع احترافية تساعد العلامات التجارية والمؤسسات على التواجد الرقمي المميز."
    },





    {
      "title": "تصميم وتنفيذ الشبكات المحلية",
      "price": "حسب حجم المشروع",
      "icon": "assets/images/network-design.svg",
      "color": "yellow",
      "details": [
        "تصميم وتركيب شبكات LAN وWAN للمؤسسات والمنازل الذكية.",
        "اختيار الأجهزة والمعدات المناسبة لضمان أفضل أداء ممكن.",
        "إدارة توصيلات الكابلات وتنظيم البنية التحتية للشبكة.",
        "توسيع أو تحديث الشبكات القائمة لتلائم متطلبات النمو."
      ],
      "description": "نقوم بتصميم وتنفيذ شبكات محلية موثوقة تضمن اتصالًا مستقرًا وسريعًا لجميع الأنظمة والأجهزة."
    },
    {
      "title": "إعداد وتكوين أجهزة الشبكات",
      "price": "ابتداءً من 499 ر.س",
      "icon": "assets/images/router-config.svg",
      "color": "blue",
      "details": [
        "إعداد الراوترات والسويتشات ونقاط الوصول (Access Points).",
        "تهيئة عناوين IP وتوزيع الشبكات الفرعية (Subnets).",
        "ضبط إعدادات الأمان وحماية الشبكات اللاسلكية.",
        "تحسين أداء الشبكة عبر إدارة المرور وتوزيع الحمل."
      ],
      "description": "نقدّم خدمات احترافية في تكوين وإدارة أجهزة الشبكات لضمان أداء ثابت واتصال آمن."
    },
    {
      "title": "أمان وحماية الشبكات",
      "price": "حسب التقييم الأمني",
      "icon": "assets/images/network-security.svg",
      "color": "sky",
      "details": [
        "تحليل الثغرات الأمنية في البنية التحتية للشبكة.",
        "تطبيق أنظمة الجدران النارية (Firewalls) وأنظمة كشف التسلل.",
        "تشفير الاتصالات وتأمين البيانات ضد الهجمات.",
        "تدريب المستخدمين على سياسات الأمان الرقمي."
      ],
      "description": "نحمي شبكاتك من المخاطر الرقمية عبر حلول أمنية متقدمة تضمن سرية البيانات واستمرارية الخدمة."
    },
    {
      "title": "الربط بين الأنظمة الصناعية والشبكات",
      "price": "يُحدد بعد المعاينة الفنية",
      "icon": "assets/images/industrial-network.svg",
      "color": "purple",
      "details": [
        "ربط أنظمة التحكم الصناعية (PLC – SCADA) بالشبكات المحلية.",
        "دمج أنظمة الطاقة والمراقبة ضمن شبكة موحدة.",
        "تأمين الاتصالات بين الأنظمة التشغيلية والإدارية.",
        "إدارة البيانات الصناعية ومزامنتها مع الأنظمة السحابية."
      ],
      "description": "نوفّر حلول ربط ذكية تدمج الشبكات التقليدية مع الأنظمة الصناعية لتحقيق مراقبة وتحكم شاملين."
    },
    {
      "title": "تحليل وصيانة الشبكات",
      "price": "ابتداءً من 599 ر.س",
      "icon": "assets/images/network-maintenance.svg",
      "color": "green",
      "details": [
        "تحليل أداء الشبكة واكتشاف نقاط الضعف أو الاختناق.",
        "صيانة الأجهزة واستبدال المكونات المتضررة.",
        "مراقبة الشبكة على مدار الساعة لضمان الاستقرار.",
        "تقديم تقارير مفصلة عن الأداء والاستهلاك."
      ],
      "description": "نقدم خدمات تحليل وصيانة شبكات تضمن استمرارية الاتصال بأعلى كفاءة وأقل انقطاع ممكن."
    },





        {
          "title": "تصميم أنظمة إنترنت الأشياء",
          "price": "حسب نطاق المشروع",
          "icon": "assets/images/iot-design.svg",
          "color": "blue",
          "details": [
            "تحليل احتياجات المشروع وتصميم بنية نظام IoT متكاملة.",
            "تحديد أنواع المستشعرات والأجهزة المناسبة للتطبيق.",
            "تصميم تدفق البيانات من الأجهزة إلى السحابة أو قاعدة البيانات.",
            "إعداد واجهات استخدام تفاعلية لعرض البيانات والتحكم بالأجهزة."
          ],
          "description": "نصمم أنظمة إنترنت أشياء متكاملة تربط بين الأجهزة والمستخدمين عبر الإنترنت لتوفير تحكم ذكي ومراقبة فعّالة."
        },
        {
          "title": "تطوير أنظمة المراقبة والتحكم عن بُعد",
          "price": "يُحدد بعد دراسة المتطلبات",
          "icon": "assets/images/remote-monitor.svg",
          "color": "green",
          "details": [
            "برمجة وحدات اتصال لجمع البيانات من المستشعرات والمعدات.",
            "إنشاء أنظمة مراقبة في الوقت الفعلي للمنشآت والمواقع.",
            "توفير تحكم مباشر بالأجهزة من أي مكان عبر الويب أو التطبيق.",
            "تطبيق نظام تنبيهات لحظية في حال حدوث أعطال أو تجاوزات."
          ],
          "description": "نطوّر حلول مراقبة وتحكم عن بُعد تسمح بإدارة الأجهزة والأنظمة في الوقت الفعلي عبر الإنترنت."
        },
        {
          "title": "أنظمة القياس الذكية وجمع البيانات",
          "price": "ابتداءً من 499 ر.س",
          "icon": "assets/images/data-collection.svg",
          "color": "sky",
          "details": [
            "تصميم وحدات قياس ذكية لقراءة وتحليل الاستهلاك أو الأداء.",
            "تخزين البيانات محليًا أو على السحابة بشكل آمن.",
            "تحليل البيانات لإصدار تقارير وتوصيات تشغيلية.",
            "دعم بروتوكولات الاتصال المتعددة مثل MQTT وHTTP وModbus."
          ],
          "description": "نقدم حلول قياس ذكية لجمع البيانات وتحليلها بشكل دقيق يساعد على تحسين الأداء وكفاءة الموارد."
        },
        {
          "title": "الأنظمة السحابية وبوابات IoT",
          "price": "حسب نوع النظام",
          "icon": "assets/images/iot-cloud.svg",
          "color": "yellow",
          "details": [
            "تطوير بوابات IoT لجمع وإرسال البيانات من الأجهزة إلى الخوادم.",
            "تصميم قواعد بيانات سحابية لاستيعاب البيانات من مصادر متعددة.",
            "إدارة الأجهزة عن بُعد وتحديثها عبر المنصات السحابية.",
            "تأمين الاتصال بين الأجهزة والسحابة بتقنيات تشفير متقدمة."
          ],
          "description": "ننشئ بنى تحتية سحابية قوية لربط الأجهزة وإدارة البيانات بمرونة وأمان عالي."
        },
        {
          "title": "تحويل الأنظمة التقليدية إلى ذكية",
          "price": "حسب حالة النظام",
          "icon": "assets/images/smart-upgrade.svg",
          "color": "red",
          "details": [
            "تحليل النظام الحالي وتحديد نقاط التحسين الممكنة.",
            "إضافة وحدات استشعار واتصال لتوفير المراقبة والتحكم الذكي.",
            "ربط النظام بالإنترنت أو الشبكة الداخلية لسهولة الإدارة.",
            "تطوير لوحة تحكم ذكية لعرض الأداء والتحكم الكامل بالنظام."
          ],
          "description": "نحوّل الأنظمة التقليدية إلى حلول ذكية متصلة قادرة على التفاعل والمراقبة الفورية لرفع الكفاءة التشغيلية."
        },
      



        
            {
              "title": "تطوير نماذج الذكاء الاصطناعي",
              "price": "حسب تعقيد المشروع",
              "icon": "assets/images/ai-model.svg",
              "color": "blue",
              "details": [
                "تصميم وتدريب نماذج ذكاء اصطناعي لمختلف المجالات.",
                "تطوير أنظمة تصنيف، تنبؤ، تحليل صور، أو معالجة نصوص.",
                "استخدام أحدث تقنيات تعلم الآلة والتعلم العميق.",
                "تحسين أداء النماذج لتحقيق أعلى دقة وكفاءة."
              ],
              "description": "نطور حلول ذكاء اصطناعي متقدمة تشمل الرؤية الحاسوبية، التنبؤ، التحليل النصي، وغيرها من التطبيقات الذكية."
            },
            {
              "title": "تكامل الذكاء الاصطناعي مع الأنظمة",
              "price": "يُحدد حسب البنية التقنية للنظام",
              "icon": "assets/images/ai-integration.svg",
              "color": "green",
              "details": [
                "دمج خوارزميات الذكاء الاصطناعي ضمن أنظمة ويب أو IoT.",
                "تحويل الأنظمة التقليدية إلى حلول ذكية تعتمد على التحليل الذاتي.",
                "استخدام الذكاء الاصطناعي في تحسين العمليات التشغيلية.",
                "توفير واجهات ذكية لتفاعل المستخدم مع النظام."
              ],
              "description": "نضيف الذكاء إلى الأنظمة عبر دمج خوارزميات التعلم والتحليل، مما يجعلها قادرة على اتخاذ قرارات ذاتية."
            },
            {
              "title": "تحليل البيانات وبناء النماذج التنبؤية",
              "price": "ابتداءً من 699 ر.س",
              "icon": "assets/images/data-analytics.svg",
              "color": "sky",
              "details": [
                "جمع وتنظيف البيانات من مصادر متعددة.",
                "تحليل الاتجاهات واستخراج المؤشرات المهمة للأداء.",
                "بناء نماذج تنبؤية تساعد في اتخاذ القرارات المستقبلية.",
                "عرض النتائج عبر لوحات تحكم ورسوم بيانية تفاعلية."
              ],
              "description": "نقدّم خدمات تحليل بيانات شاملة تساعدك على فهم الأداء الحالي والتنبؤ بالنتائج المستقبلية بدقة عالية."
            },
            {
              "title": "أنظمة الكشف والتشخيص الذكي",
              "price": "حسب التطبيق الصناعي أو التقني",
              "icon": "assets/images/fault-detection.svg",
              "color": "yellow",
              "details": [
                "تطوير أنظمة قادرة على اكتشاف الأعطال بشكل تلقائي.",
                "تحليل البيانات التشغيلية للكشف المبكر عن المشكلات.",
                "توليد تنبيهات ذكية وإجراءات تصحيحية آلية.",
                "دمج النظام مع بيئات صناعية أو هندسية حقيقية."
              ],
              "description": "نطور حلول كشف وتشخيص تعتمد على الذكاء الاصطناعي لمراقبة الأداء ومنع الأعطال قبل حدوثها."
            },
            {
              "title": "الرؤية الحاسوبية والتعرف على الأنماط",
              "price": "حسب طبيعة المشروع",
              "icon": "assets/images/computer-vision.svg",
              "color": "red",
              "details": [
                "تطوير أنظمة تعرف على الوجوه أو الأجسام أو العناصر في الصور.",
                "تحليل الفيديوهات لاستخراج معلومات تشغيلية أو أمنية.",
                "استخدام الشبكات العصبية العميقة لمعالجة الصور بدقة.",
                "دمج الرؤية الحاسوبية في تطبيقات صناعية أو تعليمية."
              ],
              "description": "نوفّر حلول رؤية حاسوبية متقدمة قادرة على تحليل الصور والفيديوهات لاكتشاف الأنماط والتفاعل مع البيئة بذكاء."
            },
          

          

          
                {
                  "title": "تصميم الدوائر الإلكترونية",
                  "price": "حسب تعقيد المشروع",
                  "icon": "assets/images/electronics-design.svg",
                  "color": "blue",
                  "details": [
                    "تصميم دوائر كهربائية وتمثيلها على برامج CAD متخصصة.",
                    "اختيار المكونات الكهربائية والالكترونية الأنسب لكل تطبيق.",
                    "إجراء محاكاة للدوائر قبل التنفيذ لضمان الأداء المطلوب.",
                    "تطوير حلول متقدمة للدوائر التناظرية والرقمية."
                  ],
                  "description": "نصمم دوائر إلكترونية متكاملة وموثوقة، مع محاكاة دقيقة واختيار أمثل للمكونات لتلبية احتياجات المشاريع المختلفة."
                },
                {
                  "title": "تصميم لوحات PCB",
                  "price": "ابتداءً من 599 ر.س",
                  "icon": "assets/images/pcb-design.svg",
                  "color": "green",
                  "details": [
                    "تحويل مخططات الدوائر إلى تصميمات PCB احترافية.",
                    "تخطيط المسارات والمكونات لتحقيق أفضل أداء كهربائي.",
                    "دعم التصميمات متعددة الطبقات والمعقدة.",
                    "إعداد الملفات للطباعة والتصنيع مباشرة."
                  ],
                  "description": "نطور لوحات PCB عالية الجودة تدعم جميع أنواع المشاريع الإلكترونية من البسيطة إلى المعقدة."
                },
                {
                  "title": "الأنظمة المدمجة Embedded Systems",
                  "price": "حسب نطاق المشروع",
                  "icon": "assets/images/embedded-systems.svg",
                  "color": "sky",
                  "details": [
                    "برمجة المتحكمات الدقيقة للتحكم بالأنظمة والمعدات.",
                    "تصميم وحدات تحكم ذكية متصلة بالأجهزة والمستشعرات.",
                    "دمج البرمجيات مع المكونات المادية لتحقيق التكامل الكامل.",
                    "اختبار الأنظمة لضمان الاستجابة والأداء السريع."
                  ],
                  "description": "نصمم أنظمة مدمجة متكاملة للتحكم بالمعدات والأجهزة، مع تكامل سلس بين البرمجيات والمكونات المادية."
                },
                {
                  "title": "محاكاة الأنظمة الإلكترونية",
                  "price": "حسب تعقيد المشروع",
                  "icon": "assets/images/simulation.svg",
                  "color": "yellow",
                  "details": [
                    "محاكاة الدوائر والأنظمة قبل التنفيذ لتقليل الأخطاء.",
                    "اختبار سيناريوهات تشغيل متعددة لضمان استقرار النظام.",
                    "تحليل الأداء واكتشاف نقاط الضعف في التصميم.",
                    "توفير تقارير شاملة عن نتائج المحاكاة والتوصيات."
                  ],
                  "description": "نقدم محاكاة دقيقة للأنظمة الإلكترونية لتقليل الأخطاء وضمان أداء مثالي عند التطبيق الفعلي."
                },
                {
                  "title": "صيانة وتحليل الأعطال الإلكترونية",
                  "price": "ابتداءً من 250 ر.س",
                  "icon": "assets/images/repair.svg",
                  "color": "red",
                  "details": [
                    "تشخيص الأعطال في الدوائر والمكونات الإلكترونية.",
                    "تقديم حلول فعّالة لإصلاح أو تحسين الأداء.",
                    "اختبار الأنظمة بعد الصيانة للتأكد من استقرارها.",
                    "تقديم استشارات لتجنب الأعطال المستقبلية."
                  ],
                  "description": "نوفر خدمات صيانة وتحليل الأعطال الإلكترونية لضمان استمرارية الأنظمة بأعلى كفاءة."
                },


                
                    {
                      "title": "إرشاد وتوجيه مشاريع التخرج",
                      "price": "حسب حجم المشروع",
                      "icon": "assets/images/student-guidance.svg",
                      "color": "purple",
                      "details": [
                        "تقديم استشارات فنية للطلاب حول اختيار موضوع المشروع.",
                        "تصميم خطة عمل منظمة لمراحل المشروع خطوة بخطوة.",
                        "مساعدة في اختيار الأدوات والبرمجيات والمكونات المناسبة.",
                        "توجيه الطلاب في حل المشكلات التقنية أثناء تطوير المشروع."
                      ],
                      "description": "نوفر إرشاداً متخصصاً لطلاب الجامعات لمساعدتهم على إنجاز مشاريع التخرج بنجاح وكفاءة."
                    },
                    {
                      "title": "تصميم وتنفيذ مشاريع تعليمية",
                      "price": "ابتداءً من 199 ر.س",
                      "icon": "assets/images/educational-project.svg",
                      "color": "pink",
                      "details": [
                        "تطوير مشاريع تعليمية تفاعلية في مجال الإلكترونيات والبرمجة.",
                        "بناء أنظمة عملية لتوضيح المفاهيم النظرية للطلاب.",
                        "إضافة واجهات استخدام جذابة لتسهيل الفهم والتجربة.",
                        "توفير ملفات تعليمية وتجارب عملية جاهزة للعرض."
                      ],
                      "description": "نساعد الطلاب على تطبيق المعرفة النظرية من خلال مشاريع تعليمية مبتكرة وواقعية."
                    },
                    {
                      "title": "ورش عمل ودورات تدريبية عملية",
                      "price": "حسب نوع الورشة",
                      "icon": "assets/images/workshop.svg",
                      "color": "indigo",
                      "details": [
                        "تنظيم ورش عمل عملية في البرمجة، الذكاء الاصطناعي، والشبكات.",
                        "تدريب الطلاب على التعامل مع المكونات الإلكترونية والأنظمة الذكية.",
                        "تقديم أمثلة حية ومشاريع تطبيقية قصيرة خلال الورشة.",
                        "توفير شهادات حضور وتقييم لمهارات الطلاب."
                      ],
                      "description": "نقدّم ورش عمل ودورات عملية تتيح للطلاب اكتساب مهارات تقنية متقدمة وتجربة مباشرة للمفاهيم."
                    },
                    {
                      "title": "تطوير نماذج محاكاة للمشاريع",
                      "price": "ابتداءً من 499 ر.س",
                      "icon": "assets/images/simulation-student.svg",
                      "color": "teal",
                      "details": [
                        "إنشاء نماذج محاكاة للأنظمة الإلكترونية والميكاترونكس.",
                        "توضيح سيناريوهات عمل المشاريع قبل التنفيذ الفعلي.",
                        "تمكين الطلاب من اختبار الأفكار وتحسين تصميمهم.",
                        "إعداد تقارير توضيحية ورسوم بيانية للنتائج."
                      ],
                      "description": "نقدّم خدمات تطوير نماذج محاكاة تساعد الطلاب على اختبار مشاريعهم وتقديم حلول أكثر دقة وواقعية."
                    },
                    {
                      "title": "استشارات تقنية للبحوث الجامعية",
                      "price": "حسب حجم البحث",
                      "icon": "assets/images/research-consult.svg",
                      "color": "orange",
                      "details": [
                        "مساعدة الطلاب في تصميم منهجيات البحث العلمي.",
                        "اقتراح أدوات وبرمجيات مناسبة لجمع البيانات وتحليلها.",
                        "تقديم دعم فني لتطبيقات البحث المعقدة أو البرمجيات العلمية.",
                        "توجيه الطلاب نحو أفضل الممارسات الأكاديمية والتقنية."
                      ],
                      "description": "نوفر استشارات تقنية متكاملة للطلاب في بحوثهم الجامعية لضمان جودة النتائج ودقتها العلمية."
                    },
                  
                    
                        {
                          "title": "التسويق الرقمي وإدارة الحملات",
                          "price": "ابتداءً من 299 ر.س",
                          "icon": "assets/images/digital-marketing.svg",
                          "color": "blue",
                          "details": [
                            "إعداد استراتيجيات تسويق رقمي متكاملة للشركات والمشاريع.",
                            "إدارة الحملات على منصات التواصل الاجتماعي ومحركات البحث.",
                            "تحليل أداء الحملات ورفع معدلات الوصول والتحويل.",
                            "تقديم تقارير شاملة لتقييم النتائج وتحسين الأداء المستقبلي."
                          ],
                          "description": "نقدّم خدمات التسويق الرقمي لإيصال علامتك التجارية للجمهور المستهدف وزيادة التفاعل والمبيعات."
                        },
                        {
                          "title": "إنشاء وإدارة المحتوى الرقمي",
                          "price": "حسب حجم المشروع",
                          "icon": "assets/images/content-creation.svg",
                          "color": "green",
                          "details": [
                            "كتابة وتصميم محتوى جذاب للمواقع ووسائل التواصل الاجتماعي.",
                            "تطوير محتوى تفاعلي مثل الفيديوهات والرسوم المتحركة والإنفوغرافيك.",
                            "تحسين المحتوى ليتوافق مع معايير SEO وجذب الزوار.",
                            "تخطيط وجدولة المحتوى لضمان استمرارية النشر والتفاعل."
                          ],
                          "description": "نوفر إنشاء وإدارة المحتوى الرقمي بشكل احترافي لجذب العملاء وتحقيق أهداف العلامة التجارية."
                        },
                        {
                          "title": "تصميم الحملات الإعلانية",
                          "price": "حسب نوع الحملة",
                          "icon": "assets/images/ads-design.svg",
                          "color": "sky",
                          "details": [
                            "تصميم إعلانات رقمية مبتكرة للمواقع ووسائل التواصل الاجتماعي.",
                            "اختيار الصياغة البصرية والنصية لجذب الجمهور المستهدف.",
                            "تحليل تفاعل الجمهور وتحسين الإعلانات بناءً على الأداء.",
                            "إعداد حملات تسويقية مدفوعة أو مجانية للوصول الأمثل للعملاء."
                          ],
                          "description": "نقدّم تصميم الحملات الإعلانية الرقمية لجذب الانتباه وزيادة التفاعل مع علامتك التجارية."
                        },
                        {
                          "title": "تحسين محركات البحث (SEO)",
                          "price": "ابتداءً من 599 ر.س",
                          "icon": "assets/images/seo.svg",
                          "color": "yellow",
                          "details": [
                            "تحليل موقعك الحالي وتحديد نقاط التحسين لتحسين ظهوره في محركات البحث.",
                            "تحسين بنية الموقع، المحتوى، والكلمات المفتاحية.",
                            "رفع سرعة التحميل وتجربة المستخدم لتحسين ترتيب البحث.",
                            "تقديم تقارير دورية لمراقبة أداء SEO وإعداد استراتيجيات جديدة."
                          ],
                          "description": "نقدّم خدمات تحسين محركات البحث (SEO) لزيادة ظهور موقعك وجذب زيارات أكثر جودة."
                        },
                        {
                          "title": "تحليل البيانات التسويقية",
                          "price": "حسب حجم البيانات",
                          "icon": "assets/images/marketing-analytics.svg",
                          "color": "red",
                          "details": [
                            "جمع وتحليل البيانات من الحملات الرقمية ووسائل التواصل.",
                            "تحديد مؤشرات الأداء الرئيسية وتحليل سلوك العملاء.",
                            "تقديم توصيات عملية لتحسين النتائج وزيادة المبيعات.",
                            "استخدام أدوات التحليل الحديثة لمراقبة التوجهات وتحسين الأداء."
                          ],
                          "description": "نوفر تحليل بيانات تسويقية شامل لمساعدتك على اتخاذ قرارات استراتيجية وتحسين عائد الاستثمار."
                        },
                      
                        
                            {
                              "title": "حلول برمجية جاهزة",
                              "price": "حسب نوع الحل",
                              "icon": "assets/images/software-solutions.svg",
                              "color": "lime",
                              "details": [
                                "تقديم برامج جاهزة لإدارة المشاريع والمخازن والمكاتب الصغيرة.",
                                "تخصيص البرمجيات لتناسب احتياجات العملاء الفردية.",
                                "دعم التحديثات والصيانة الفنية للحفاظ على الأداء.",
                                "توفير وثائق تعليمية ودروس استخدام مرفقة مع الحل."
                              ],
                              "description": "نوفر حلول برمجية جاهزة تلبي احتياجات الشركات والطلاب، مع إمكانية التخصيص الكامل والدعم الفني المستمر."
                            },
                            {
                              "title": "مكتبات ومكونات إلكترونية جاهزة",
                              "price": "حسب نوع المكونات",
                              "icon": "assets/images/electronic-components.svg",
                              "color": "emerald",
                              "details": [
                                "توفير مكتبات إلكترونية متكاملة للدوائر والمشاريع التعليمية.",
                                "قطع ومكونات جاهزة للتجميع السريع والتجربة العملية.",
                                "مساعدة في تصميم المشاريع باستخدام المكونات المتاحة.",
                                "تقديم دليل استخدام شامل مع كل مجموعة مكونات."
                              ],
                              "description": "نوفر مكتبات ومكونات إلكترونية جاهزة لتسهيل تنفيذ المشاريع بسرعة واحترافية."
                            },
                            {
                              "title": "قوالب وتصاميم جاهزة للمواقع والتطبيقات",
                              "price": "ابتداءً من 50 ر.س",
                              "icon": "assets/images/templates.svg",
                              "color": "cyan",
                              "details": [
                                "تقديم قوالب وتصاميم جاهزة للمواقع وتطبيقات الهواتف.",
                                "تخصيص الألوان والخطوط والمحتوى لتتناسب مع العلامة التجارية.",
                                "إضافة واجهات تفاعلية وتجربة مستخدم محسنة.",
                                "دعم فني ومتابعة للتحديثات بعد التسليم."
                              ],
                              "description": "نوفر قوالب وتصاميم جاهزة للمواقع والتطبيقات لتسريع عملية التطوير وتحسين تجربة المستخدم."
                            },
                            {
                              "title": "مكتبات الذكاء الاصطناعي والبرمجيات الجاهزة",
                              "price": "حسب نوع المكتبة",
                              "icon": "assets/images/ai-libraries.svg",
                              "color": "violet",
                              "details": [
                                "توفير مكتبات جاهزة لتطبيقات الذكاء الاصطناعي والتعلم الآلي.",
                                "أمثلة عملية لتسريع دمج النماذج في المشاريع.",
                                "دعم التخصيص والتطوير حسب متطلبات المشروع.",
                                "تقديم وثائق تعليمية وأدلة استخدام شاملة."
                              ],
                              "description": "نوفر مكتبات ذكاء اصطناعي جاهزة لتسهيل دمج النماذج في المشاريع مع إمكانية التخصيص والدعم الكامل."
                            },
                            {
                              "title": "خدمات استشارية متكاملة",
                              "price": "حسب حجم الاستشارة",
                              "icon": "assets/images/consulting.svg",
                              "color": "amber",
                              "details": [
                                "تقديم استشارات تقنية متكاملة في البرمجة، الإلكترونيات، والشبكات.",
                                "مساعدة في التخطيط والتنفيذ للمشاريع الكبرى والصغيرة.",
                                "توفير تقييم شامل للحلول الحالية واقتراح تحسينات.",
                                "دعم متواصل لضمان نجاح المشروع وتحقيق أهدافه."
                              ],
                              "description": "نوفر خدمات استشارية شاملة لدعم المشاريع التقنية من الفكرة إلى التنفيذ بنجاح وكفاءة."
                            }
                          
      ]