{
      "id": "proj-13",
      "title": "نظام عدّاد طاقة كهربائية ذكي باستخدام ESP32 وBlynk",
      "shortDesc": "نظام ذكي لمراقبة استهلاك الطاقة الكهربائية لحظياً وربطه بتطبيق Blynk لعرض البيانات عن بُعد.",
      "description": "في إطار مشروعنا، قمنا بتصميم وبناء نظام عدّاد طاقة كهربائية ذكي يعمل بـ ESP32 ويعرض البيانات على تطبيق Blynk. يشمل النظام مستشعرات للتيّار والجهد، يقوم ESP32 بحساب القدرة، الطاقة المستهلكة (kWh) بعدد من الأحمال، وإرسالها مباشرة إلى واجهة المستخدم على الهاتف أو الويب. الهدف هو تمكين المستخدم من رؤية استهلاكه الكهربائي في الزمن الحقيقي، تحليل أنماط الاستخدام، واتخاذ إجراءات فعّالة لتوفير الطاقة. لقد دمجنا البرمجيات والعتاد مع بنية إنترنت الأشياء لتحقيق رؤية تحكم ومراقبة متقدمة.",
      "tags": ["IoT", "ESP32", "Blynk", "Energy Meter", "Smart Monitoring"],
      "category": "iot",
      "images": [
        "https://how2electronics.com/wp-content/uploads/2020/12/IoT-Electricity-Energy-Meter-1080x607.jpg",
        "https://how2electronics.com/wp-content/uploads/2020/12/IoT-Based-Electricity-Energy-Meter.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-14",
      "title": "نظام تعقّب شمسي ذكي قائم على إنترنت الأشياء",
      "shortDesc": "نظام IoT يوجّه لوحتي شمسيتين تلقائياً نحو الشمس، ويربطهما بالشبكة لمراقبة المعطيات البيئية والفنية.",
      "description": "قمنا بتصميم وتنفيذ نظام تعقّب شمسي ذكي يعتمد على لوحتي شمسيتين ومحركات سيرفو لتوجيههما تلقائياً نحو حرارة الشمس وضوئها، مع ربط النظام بمنصة إنترنت الأشياء لعرض بيانات الضوء، الجهد، التيار، الحرارة والرطوبة في الزمن الحقيقي. استخدمنا Arduino Mega 2560 مع درع إيثرنت (Wiznet W5100) للاتصال بالشبكة، وأربعة مستشعرات LDR لقياس شدة الضوء، ومحركي سيرفو (أفقي وعمودي) لضبط الاتجاه. تم إرسال البيانات عبر بروتوكول MQTT إلى منصة Cayenne لعرض التوجه والبيانات البيئية، مع إمكانية التحكم اليدوي/التلقائي. الهدف من المشروع هو زيادة كفاءة اللوحات الشمسية عبر التوجيه الحركي، وتحسين الرصد والمراقبة عبر الإنترنت، مما يعزز الأداء واستدامة الطاقة الشمسية.",
      "tags": ["IoT", "Solar Tracker", "Arduino Mega", "MQTT", "Cayenne Platform"],
      "category": "iot",
      "images": [
        "./assets/images/b566dee0-faa8-4cc5-8899-d4abb9b97fd4.png",
        "./assets/images/85616315-4e50-47d5-ad73-1f5ef0765b4a.png"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-15",
      "title": "نظام ري ذكي للنباتات باستخدام إنترنت الأشياء",
      "shortDesc": "نظام ذكي لري النباتات يعتمد على مراقبة رطوبة التربة، ويتيح التحكم عن بُعد عبر تطبيق Blynk.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام ري ذكي للنباتات باستخدام لوحة Arduino UNO R4 WiFi، مزودة بمستشعر رطوبة التربة FC-28، ومصفوفة LED لعرض الحالة، ومضخة ماء 5 فولت. يتم التحكم في المضخة عبر وحدة ريليه 5 فولت، وتتم مراقبة مستوى الرطوبة في التربة وعرضه في الوقت الفعلي عبر تطبيق Blynk. يتيح النظام أيضًا التحكم اليدوي في المضخة من خلال التطبيق، مما يضمن ري النباتات بشكل فعال وموثوق.",
      "tags": ["IoT", "Arduino", "Blynk", "Soil Moisture", "Smart Irrigation"],
      "category": "iot",
      "images": [
        "./assets/images/53591b5b-0f71-4d21-aeb2-8629bede4b70.jpg",
        "./assets/images/0006b619-cdfa-4f16-a273-56c0dbdec8a3.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-16",
      "title": "نظام مراقبة جودة الهواء باستخدام ESP32 وتحليل AQI في الوقت الفعلي",
      "shortDesc": "نظام ذكي لمراقبة جودة الهواء باستخدام ESP32، مع مستشعرات MQ135 وMQ2، وتحليل AQI عبر ThingSpeak.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام لمراقبة جودة الهواء باستخدام ESP32، حيث يتم جمع البيانات من مستشعرات MQ135 (للكشف عن CO₂) وMQ2 (للكشف عن الدخان والغازات). يتم إرسال البيانات إلى منصة ThingSpeak عبر Wi-Fi، حيث يتم تحليل قيم AQI وعرضها في الوقت الفعلي. يتيح النظام للمستخدمين مراقبة جودة الهواء واتخاذ الإجراءات المناسبة لتحسين البيئة المحيطة.",
      "tags": ["IoT", "ESP32", "MQ135", "MQ2", "AQI", "ThingSpeak", "Air Quality Monitoring"],
      "category": "iot",
      "images": [
        "./assets/images/ff70748b-2d0c-48bb-9b57-c72095db316f.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-17",
      "title": "نظام عدّاد طاقة كهربائية ذكي باستخدام ESP32 ولوحة تحكم ويب",
      "shortDesc": "نظام ذكي لقياس الجهد، التيار، القدرة، والطاقة المستهلكة في الوقت الفعلي باستخدام ESP32 وعرض البيانات عبر لوحة تحكم ويب.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام عدّاد طاقة كهربائية ذكي يعتمد على ESP32 لقياس الجهد والتيار والقدرة والطاقة المستهلكة. يتم عرض البيانات في الوقت الفعلي عبر لوحة تحكم ويب، مما يتيح للمستخدم مراقبة استهلاكه للطاقة واتخاذ قرارات مستنيرة لتحسين الكفاءة وتقليل الفاقد. يشمل النظام مستشعرات للتيار والجهد، مع واجهة مستخدم رسومية لعرض البيانات بشكل تفاعلي.",
      "tags": ["IoT", "ESP32", "Web Dashboard", "Energy Meter", "Real-Time Monitoring"],
      "category": "iot",
      "images": [
        "./assets/images/Build-IoT-DC-Energy-Meter-with-ESP32-Web-Dashboard.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-18",
      "title": "نظام أتمتة المنزل الذكي باستخدام إنترنت الأشياء",
      "shortDesc": "نظام متكامل للتحكم في الأجهزة المنزلية عبر الهاتف المحمول، الكمبيوتر، Alexa، Google Assistant، وTelegram، مع مراقبة استهلاك الطاقة.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام أتمتة منزلية ذكية يتيح التحكم في الأجهزة المنزلية من خلال عدة منصات، بما في ذلك تطبيق الهاتف المحمول، الكمبيوتر، Alexa، Google Assistant، وTelegram. يتيح النظام للمستخدمين مراقبة استهلاك الطاقة للأجهزة المنزلية، مع عرض تقديرات لفواتير الكهرباء بناءً على الاستخدام السابق. كما يتضمن النظام وضع الإضاءة الذكية باستخدام مستشعر الحركة PIR، الذي يكتشف الحركة لتشغيل أو إيقاف الإضاءة تلقائيًا.",
      "tags": ["IoT", "Smart Home", "Automation", "Energy Monitoring", "Alexa", "Google Assistant", "Telegram", "PIR Sensor"],
      "category": "iot",
      "images": [
        "./assets/images/https___dev-to-uploads.s3.amazonaws.com_uploads_articles_fmfppjzq3sa9j57sshq3.webp",
        "./assets/images/iot diagram.png",
        "./assets/images/flow.png"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-19",
      "title": "نظام قياس الزوايا الثلاثية (Pitch, Roll, Yaw) باستخدام ESP32 وMPU6050 وHMC5883L",
      "shortDesc": "نظام يستخدم ESP32 لقياس الزوايا الثلاثية (Pitch, Roll, Yaw) باستخدام مستشعرات MPU6050 وHMC5883L، مع عرض البيانات عبر واجهة ويب.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام لقياس الزوايا الثلاثية (Pitch, Roll, Yaw) باستخدام ESP32 ومجموعة من المستشعرات. يعتمد النظام على مستشعر MPU6050 لقياس التسارع والجيروسكوب، ومجس HMC5883L لقياس المجال المغناطيسي. يتم دمج البيانات من هذه المستشعرات لحساب الزوايا الثلاثية، ويتم عرض النتائج عبر واجهة ويب تفاعلية. يتيح هذا النظام مراقبة الاتجاهات والحركات في الفضاء ثلاثي الأبعاد، مما يجعله مناسبًا لتطبيقات مثل الطائرات بدون طيار (الدرون) والروبوتات.",
      "tags": ["ESP32", "MPU6050", "HMC5883L", "Pitch", "Roll", "Yaw", "Web Interface", "Sensor Fusion"],
      "category": "iot",
      "images": [
        "./assets/images/Measure-Pitch-Roll-Yaw-with-MPU6050-HMC5883L-ESP32.jpg",
        "./assets/images/ESP32-MPU6050-HMC5883L-OLED-Display.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-20",
      "title": "نسخة طبق الأصل من مركبة المريخ باستخدام ESP32-CAM وأردوينو",
      "shortDesc": "روبوت متحرك مزود بكاميرا ESP32-CAM، يتحكم فيه عن بُعد عبر شبكة Wi-Fi، مع تصميم هيكل ميكانيكي مستوحى من مركبة المريخ.",
      "description": "في إطار مشروعنا، قمنا بتطوير نسخة طبق الأصل من مركبة المريخ باستخدام لوحة ESP32-CAM وأردوينو. يتم التحكم في الروبوت عن بُعد عبر شبكة Wi-Fi، حيث تعرض الكاميرا الفيديو المباشر للمستخدم. يشمل المشروع تصميم هيكل ميكانيكي مستوحى من مركبة المريخ، مع استخدام محركات DC وأسطوانات مرنة لتحسين الحركة على التضاريس الوعرة. يتيح النظام للمستخدمين استكشاف البيئات المختلفة عن بُعد، مما يجعله مناسبًا للتطبيقات التعليمية والبحثية.",
      "tags": ["ESP32-CAM", "Arduino", "Mars Rover", "Wi-Fi Control", "Remote Exploration"],
      "category": "iot",
      "images": [
        "./assets/images/Mars-Rover-Robot-Replica-using-ESP32-CAM-Arduino-1000x562.jpg"
      ],
      "link":"https://example-sports.com"
    },
    {
      "id": "proj-21",
      "title": "نظام مراقبة وتحكم في مستوى المياه باستخدام ESP8266 ومستشعر فوق صوتي مقاوم للماء",
      "shortDesc": "نظام ذكي لمراقبة مستوى المياه في الخزانات والتحكم فيها عن بُعد باستخدام ESP8266 ومستشعر فوق صوتي مقاوم للماء.",
      "description": "في إطار مشروعنا، قمنا بتطوير نظام لمراقبة مستوى المياه في الخزانات والتحكم فيها عن بُعد باستخدام ESP8266 ومستشعر فوق صوتي مقاوم للماء. يتيح النظام للمستخدمين مراقبة مستوى المياه في الوقت الفعلي عبر واجهة ويب، مع إمكانية التحكم في تشغيل وإيقاف المضخات تلقائيًا بناءً على مستوى المياه. يساهم هذا النظام في تحسين كفاءة استهلاك المياه وتوفير الطاقة.",
      "tags": ["IoT", "ESP8266", "Water Level Monitoring", "Ultrasonic Sensor", "Water Tank Control", "Smart System"],
      "category": "iot",
      "images": [
        "./assets/images/IoT-Based-Water-Level-Control-Monitor-with-ESP8266-Ultrasonic-Sensor-1000x562.jpg",
        "./assets/images/IoT-Based-Water-Level-Control-Monitoring-with-ESP8266-Circuit-1536x732.jpg"
      ],
      "link":"https://example-sports.com"
    }