{
  "projects": [
    {
      "id": "app-healthify",
      "title": "تطبيق Healthify (تتبع الصحة واللياقة)",
      "shortDesc": "مساعد شخصي للصحة واللياقة البدنية مع خطط مخصصة وتتبع للوجبات والنوم.",
      "description": "قمنا بتطوير تطبيق Healthify، وهو مساعد شخصي متكامل للصحة واللياقة البدنية. يتيح التطبيق للمستخدمين تتبع تمارينهم الرياضية، تسجيل وجباتهم الغذائية، مراقبة أنماط نومهم، والحصول على خطط صحية مخصصة لمساعدتهم على تحقيق أهدافهم. يتميز التطبيق بواجهة مستخدم حديثة وبديهية، ويوفر تحليلات مفصلة للتقدم الصحي لتمكين المستخدمين من التحكم الكامل في رحلتهم الصحية.",
      "category": "mobile",
      "images": [
        "images_app/healthify_1.webp"
      ],
      "link": "https://example.com/healthify-project"
    },
    {
      "id": "app-mindflow",
      "title": "تطبيق MindFlow (التأمل واليقظة)",
      "shortDesc": "تطبيق يومي للتأمل واليقظة مع جلسات موجهة لتقليل التوتر وتحسين التركيز.",
      "description": "صممنا تطبيق MindFlow ليكون رفيقك اليومي للتأمل واليقظة. يوفر التطبيق مجموعة واسعة من جلسات التأمل الموجهة لمساعدة المستخدمين على تقليل التوتر، تحسين التركيز، وتعزيز الهدوء الداخلي. يتميز بمكتبة صوتية غنية وقدرة على تتبع حالات المزاج والتقدم، مما يخلق واحة هادئة في عالم مليء بالضوضاء.",
      "tags": ["Flutter", "Audio Streaming", "MongoDB", "Figma Design"],
      "category": "mobile",
      "images": [
        "images_app/mindflow_1.webp"
      ],
      "link": "https://example.com/mindflow-project"
    },
    {
      "id": "app-voyageai",
      "title": "تطبيق Voyage AI (دليل سياحي بالذكاء الاصطناعي)",
      "shortDesc": "دليل سياحي مدعوم بالذكاء الاصطناعي لتخطيط الرحلات وتوصيات المطاعم والأنشطة.",
      "description": "طوّرنا تطبيق Voyage AI ليكون دليلاً سياحياً متكاملاً ومدعوماً بالذكاء الاصطناعي. يتيح للمستخدمين اكتشاف وجهات جديدة، تخطيط خط سير رحلتهم المثالي، والحصول على توصيات شخصية للمطاعم والأنشطة بناءً على اهتماماتهم. يدمج التطبيق خرائط تفاعلية وميزة إنشاء مسارات تلقائية لمساعدة المستخدمين في تصميم رحلات لا تُنسى دون عناء التخطيط.",
      "tags": ["Kotlin", "Swift", "OpenAI API", "Google Maps API", "AI"],
      "category": "mobile",
      "images": [
        "images_app/voyageai_1.webp"
      ],
      "link": "https://example.com/voyageai-project"
    },
    {
      "id": "app-skillup",
      "title": "تطبيق SkillUp (منصة تعليمية مصغرة)",
      "shortDesc": "منصة للتعلم المستمر وتطوير المهارات من خلال دورات قصيرة ومكثفة في مجالات متعددة.",
      "description":  "أنشأنا تطبيق SkillUp كمنصة للتعلم المستمر وتطوير المهارات. يتيح التطبيق للمستخدمين اكتشاف دورات تدريبية قصيرة ومكثفة في مجالات متنوعة، من البرمجة والتسويق إلى الإبداع والمهارات الشخصية، كل ذلك في متناول أيديهم. يتضمن نظام تتبع للتقدم واختبارات قصيرة لمساعدتهم على النمو واكتشاف شغف جديد.",
      "tags": ["React Native", "Video Streaming", "Subscription Model", "Node.js"],
      "category": "mobile",
      "images": [
        "images_app/skillup_1.webp"
      ],
      "link": "https://example.com/skillup-project"
    },
    {
      "id": "app-novabank",
      "title": "تطبيق NovaBank (مصرفية رقمية ذكية)",
      "shortDesc": "تطبيق مصرفي لإدارة الحسابات، التحويلات، وتتبع الإنفاق بتصميم سلس وآمن.",
      "description":  "قمنا بتصميم وتطوير NovaBank ليكون تطبيقك المصرفي الذكي الذي يضع التحكم المالي بين يديك. يوفر التطبيق إمكانية إدارة الحسابات، إجراء التحويلات، تتبع الإنفاق، وتلقي تنبيهات مخصصة، كل ذلك بواجهة سلسة وآمنة. يتميز بالتحليلات البيانية لنمط الإنفاق لمساعدة المستخدمين على فهم وإدارة مواردهم المالية بفعالية.",
      "tags": ["Swift", "Kotlin", "Security Protocols", "Financial API", "UI/UX"],
      "category": "mobile",
      "images": [
        "images_app/novabank_1.webp"
      ],
      "link": "https://example.com/novabank-project"
    },
    {
      "id": "app-aurahome",
      "title": "تطبيق Aura Home (المنزل الذكي)",
      "shortDesc": "مركز تحكم شامل لإدارة الأضواء، الحرارة، الأجهزة، وأنظمة الأمان في المنزل الذكي.",
      "description":  "صممنا Aura Home ليكون مركز التحكم الذكي الشامل لمنزلك. يتيح التطبيق للمستخدمين التحكم في الأضواء، الحرارة، الأجهزة، وأنظمة الأمان، كلها من مكان واحد. استمتع بالراحة والأمان مع واجهة سهلة الاستخدام وقابلة للتخصيص، ويتكامل مع مختلف بروتوكولات الأجهزة الذكية لتحويل أي منزل إلى مساحة ذكية تتكيف مع الاحتياجات.",
      "tags": ["Flutter", "IoT Integration", "MQTT/HTTP", "Cloud Functions"],
      "category": "mobile",
      "images": [
        "images_app/aurahome_1.webp"
      ],
      "link": "https://example.com/aurahome-project"
    },
    {
      "id": "app-velofit",
      "title": "تطبيق VeloFit (ركوب الدراجات)",
      "shortDesc": "تطبيق لراكبي الدراجات لتتبع المسارات والأداء، واكتشاف طرق جديدة، والتواصل مع المجتمع.",
      "description": "طوّرنا تطبيق VeloFit ليكون الرفيق الأمثل لراكبي الدراجات، المصمم لتعزيز تجربتهم في كل جولة. يتيح التطبيق تتبع مساراتهم بدقة، مراقبة أدائهم، اكتشاف طرق جديدة، والتواصل مع مجتمع راكبي الدراجات. يوفر تتبعاً دقيقاً باستخدام GPS ورؤى متقدمة للأداء لمساعدة المستخدمين على الارتقاء برحلاتهم إلى المستوى التالي.",
      "tags": ["React Native", "GPS Tracking", "Real-time Data", "Social Features"],
      "category": "mobile",
      "images": [
        "images_app/velofit_1.webp"
        
      ],
      "link": "https://example.com/velofit-project"
    },
    {
      "id": "app-swiftdash",
      "title": "تطبيق SwiftDash (توصيل طلبات)",
      "shortDesc": "تطبيق موثوق لتوصيل وجبات المطاعم والبقالة والطرود مع تتبع مباشر للطلب.",
      "description":  "قمنا بتطوير SwiftDash ليكون تطبيقك الموثوق لتوصيل كل ما تحتاجه، من وجبات المطاعم المفضلة لديك إلى مستلزمات البقالة وحتى الطرود العاجلة. يتميز بتوصيل سريع وموثوق به، مع تتبع مباشر لطلبك على الخريطة. يشتمل على واجهات متعددة وسهلة الاستخدام لتسهيل اختيار المنتجات وتتبع الطلبات في الوقت الفعلي.",
      "tags": ["Flutter", "Google Maps API", "Payment Gateway", "Real-time Tracking", "Logistics"],
      "category": "mobile",
      "images": [
        "images_app/swiftdash_1.webp",
        "images_app/swiftdash_2.webp",
        "images_app/swiftdash_3.webp"
      ],
      "link": "https://example.com/swiftdash-project"
    },
    {
      "id": "app-pulsestream",
      "title": "تطبيق PulseStream (البث المباشر)",
      "shortDesc": "بوابة لعالم البث المباشر للأحداث الرياضية والموسيقية والمؤتمرات بجودة عالية.",
      "description":  "أنشأنا PulseStream ليكون بوابتك إلى عالم البث المباشر للأحداث الرياضية، الموسيقية، والمؤتمرات. يتيح لك التطبيق متابعة فعالياتك المفضلة بجودة عالية، التفاعل مع الجماهير الأخرى، والحصول على إشعارات مخصصة لضمان عدم تفويت أي لحظة. يدعم التطبيق ميزات التعليق المباشر والتفاعل الفوري مع البث لتجربة مشاهدة غامرة.",
      "tags": ["React Native", "Live Streaming", "WebRTC", "Push Notifications"],
      "category": "mobile",
      "images": [
        "images_app/pulsestream_1.webp"
      ],
      "link": "https://example.com/pulsestream-project"
    }
  ]
}